import math

 #【資料庫】苗栗市避難所資料
shelters = [
    {"name": "建功國小操場", "address": "苗栗縣苗栗市建功里中正路241號",
     "lat": 24.55438701578612, "lon": 120.81516325183188},

    {"name": "大同國小活動中心", "address": "苗栗縣苗栗市大同里大同路80號",
     "lat": 24.56547988694313, "lon": 120.82517510156349},

    {"name": "維新社區活動中心", "address": "苗栗縣苗栗市維新里僑育北街62號1樓",
     "lat": 24.553262523711048, "lon": 120.82167178251852},

    {"name": "高苗里社區活動中心", "address": "苗栗縣苗栗市高苗里22鄰松園1號",
     "lat": 24.54959920520317, "lon": 120.81140292884962},

    {"name": "苗栗市老人文康中心室外草皮", "address": "苗栗縣苗栗市大同里福星山21號",
     "lat": 24.55676485537507, "lon": 120.80831805482921},

    {"name": "勝利社區活動中心", "address": "苗栗縣苗栗市復興路一段449號",
     "lat": 24.548138729302718, "lon": 120.8212071677126},

    {"name": "苗栗市恭敬里活動中心", "address": "苗栗縣苗栗市恭敬路107號",
     "lat": 24.548440963722076, "lon": 120.81478101660939},

    {"name": "國立聯合大學活動中心、操場", "address": "苗栗縣苗栗市恭敬里聯大1號",
     "lat": 24.546022406876844, "lon": 120.81239705978817},

    {"name": "上苗里社區活動中心室內空間", "address": "苗栗縣苗栗市北苗里中華路45號2樓",
     "lat": 24.571238180193863, "lon": 120.82430810950412},

    {"name": "清華里社區活動中心", "address": "苗栗縣苗栗市清華里啟賢街126巷23號",
     "lat": 24.572578235924503, "lon": 120.82983814944413},

    {"name": "福星國小操場", "address": "苗栗縣苗栗市清華里啟賢街126巷23號",
     "lat": 24.57952418333503, "lon": 120.82596278013091},
]